     D getTime_SQL     pr
     D   inTime                      80a   varying const
     D   ouTime                        t   timfmt(*iso)
     D   inNull                       5i 0         const
     D   ouNull                       5i 0
     D   ouSQLState                   5a
     D   inFuncName                 517a           const
     D   inSpecifName               128a           const
     D   ouMsgText                 1000a   varying
